* TODOs                                                                 :BLOG:
*** TODO write new blog
    SCHEDULED: <2019-11-19 Tue +2w>
    :PROPERTIES:
    :LAST_REPEAT: [2019-11-08 Fri 23:02]
    :END:
    - State "DONE"       from "TODO"       [2019-11-08 Fri 23:02]
    - State "DONE"       from "TODO"       [2019-10-22 Tue 14:55]
    - State "DONE"       from "TODO"       [2019-10-09 Wed 15:37]
    - State "DONE"       from "TODO"       [2019-10-01 Tue 17:55]
    - State "DONE"       from "TODO"       [2019-09-10 Tue 16:59]
    - State "DONE"       from "TODO"       [2019-08-30 Fri 10:47]
    - State "DONE"       from "TODO"       [2019-08-13 Tue 10:57]
    - State "DONE"       from "TODO"       [2019-07-23 Tue 16:43]
    - State "DONE"       from "TODO"       [2019-07-16 Tue 21:31]
    - State "DONE"       from "TODO"       [2019-06-27 Thu 10:56]
    - State "DONE"       from "TODO"       [2019-06-26 Wed 18:10]
    - State "DONE"       from "TODO"       [2019-05-31 Fri 16:58]
    - State "DONE"       from "TODO"       [2019-05-03 Fri 20:18]
    - State "DONE"       from "TODO"       [2019-04-19 Fri 15:36]
    - State "DONE"       from "TODO"       [2019-04-09 Tue 17:12]
    - State "DONE"       from "TODO"       [2019-03-27 Wed 15:16]
*** TODO Renew Lets Encrypt SSL certificate
    SCHEDULED: <2019-12-19 Thu +11w>
    :PROPERTIES:
    :LAST_REPEAT: [2019-10-03 Thu 13:36]
    :END:
    - State "DONE"       from "TODO"       [2019-10-03 Thu 13:36]
    - State "DONE"       from "TODO"       [2019-07-05 Fri 13:17]
** Posts
*** DONE write 2018 review
    CLOSED: [2019-01-02 Wed] SCHEDULED: <2019-01-02 Wed>
*** signature aggregation schemas (Threshold, Ring)
*** DONE open source Actihunt
    CLOSED: [2019-02-14 Thu] SCHEDULED: <2019-02-14 Thu>
*** DONE deribit-api-ruby library
    CLOSED: [2019-05-03 Fri 20:10]
    :LOGBOOK:
    CLOCK: [2019-05-03 Fri 17:10]--[2019-05-03 Fri 20:10] =>  3:00
    :END:
*** DONE bitmex-api-ruby library
    CLOSED: [2019-02-02 Sat] SCHEDULED: <2019-02-02 Sat>
*** bitmex mobile app
*** organize projects with org-mode/agenda
*** Homomorphic commitments: Pedersen vs. ElGamal
*** Schnorr vs. Threshold signature aggregations
*** literate blogging with Orgmode
    - evaluate block inline
    - counting lines
    - pass results between blocks
    - edit block's content in native buffer
    - exporting to multiple formats
*** DONE Week/Day close tradingview indicator
    CLOSED: [2019-02-28 Thu] SCHEDULED: <2019-02-28 Thu>
*** cryptographic trap-doors
*** homomorphic encryption
*** DONE zero-knowledge proofs
    CLOSED: [2019-08-29 Thu 17:16]
*** DONE RSA encryption scheme
    CLOSED: [2019-03-18 Mon] SCHEDULED: <2019-03-15 Fri>
*** personal finance with Ledger
*** DONE ElGamal encryption scheme
    CLOSED: [2019-03-27 Wed 15:18] SCHEDULED: <2019-03-26 Tue>
   :LOGBOOK:
   CLOCK: [2019-03-27 Wed 11:14]--[2019-03-27 Wed 15:17] => 4:03
   :END:
*** NTRU lattice-based encryption scheme
    :PROPERTIES:
    :ID:       750DD774-7C04-45F2-90BF-5FE3FFB4E26E
    :END:
    :LOGBOOK:
    CLOCK: [2019-05-03 Fri 11:49]--[2019-05-03 Fri 15:09] =>  3:20
    CLOCK: [2019-05-02 Thu 10:12]--[2019-05-02 Thu 18:04] =>  7:52
    :END:
*** DONE from Jekyll to Hugo
    CLOSED: [2019-04-19 Fri 14:50]
    :LOGBOOK:
    CLOCK: [2019-04-19 Fri 14:07]--[2019-04-19 Fri 14:50] =>  0:43
    :END:
*** DONE ECDSA signature scheme
    CLOSED: [2019-04-09 Tue 17:12]
    :LOGBOOK:
    CLOCK: [2019-04-09 Tue 11:37]--[2019-04-09 Tue 17:12] =>  5:35
    CLOCK: [2019-04-07 Sun 07:48]--[2019-04-07 Sun 18:45] => 10:57
    :END:
*** DONE slices of Bitcoin indicator
    CLOSED: [2019-05-31 Fri 16:20]
*** DONE Schnorr signatures
    CLOSED: [2019-06-27 Thu 10:56]
*** DONE Arch linux
    CLOSED: [2019-07-16 Tue 21:13]
*** DONE package management with Pacman, Rua, Stow
    CLOSED: [2019-09-10 Tue 16:09]
    :LOGBOOK:
    CLOCK: [2019-09-10 Tue 11:30]--[2019-09-10 Tue 16:09] =>  4:39
    :END:
*** DONE password management with Bitwarden
    CLOSED: [2019-08-13 Tue 10:55]
*** DONE configuration management with Mackup and Etckeeper
    CLOSED: [2019-10-22 Tue 14:55]
*** DONE 3DP project
    CLOSED: [2019-07-23 Tue 16:40]
*** understanding GnuPG
*** DONE in-file navigation in Emacs
    CLOSED: [2019-11-08 Fri 22:56]
     - with both avy and evil, use demo-it for presentation
     - jumps to word, line (with folded paragraphs), timer with avy
     - goto top/middle/bottom of the page
     - goto prev/next edit
     - scroll (cursor remains on the same line, screen moves) horizontal/veritical by chars, lines, pages
     - move (cursor moves to new lines, screen remains) horizontal/veritical by char, line, pages, screens
*** file navigation in Emacs
     - goto prev/next edit
     - code: variable, function, definition, documentation
     - find files, buffers
     - find in current buffer, all open buffers, project, files
*** protect your digital life
    - disk encryption
    - multiple laptops / phones
    - data in sync on all devices
    - keep very critical stuff online (albums, important papers) as well for redundancy
    - passwords manager with 3 layer protection: pass, 2FA, ?
    - 2FA in sync on a few devices only
*** FLASC trading strategy
*** DONE elliptic curves
    CLOSED: [2019-10-01 Tue 17:38]
*** finite fields with graphs
*** DONE leaving Apple/Googlle and /e/
    CLOSED: [2019-10-09 Wed 14:40]
*** disk encryption/block ciphers
    - stacked filesystem vs. block device
    - block ciphers: e.g. aes-xts-plain
    - mode of operation: ECB, CBC, XTS https://en.wikipedia.org/wiki/Disk_encryption_theory
*** DONE surviving Bali
    CLOSED: [2019-11-19 Tue 18:33]
** Fixes
*** add Euler's method to RSA
*** DONE add tags to all posts
    CLOSED: [2019-08-13 Tue 13:19]
*** DONE use session for Python src blocks
    CLOSED: [2019-03-26 Tue]
*** use naming conventions: p - prime, m - message, c - cipher, t - trapdoor
*** use latex formulas
*** links with ' sign
*** use org citation, references
*** DONE add subtitles
    CLOSED: [2019-08-13 Tue 13:19]
*** DONE fix URLs points to other posts
    CLOSED: [2019-07-05 Fri 11:27]
*** DONE fix Arch post's images
    CLOSED: [2019-09-26 Thu 15:44]
*** double check Schnorr signature s = t - m*x?
*** DONE fix the fucking org-mode
    CLOSED: [2019-09-26 Thu 17:54]
*** add syntax highlight for older md files
** Tasks
*** DONE Wakatime reports=B$9
    CLOSED: [2019-03-14 Thu] SCHEDULED: <2019-03-14 Thu>
*** Runkeeper reports
*** DONE add comments
    CLOSED: [2019-05-02 Thu 10:03]
    :LOGBOOK:
    CLOCK: [2019-05-02 Thu 09:30]--[2019-05-02 Thu 10:02] =>  0:32
    :END:
*** DONE migrate blog to Hugo+Gitlab
    CLOSED: [2019-04-19 Fri 13:41]
   :LOGBOOK:
   CLOCK: [2019-04-19 Fri 09:50]--[2019-04-19 Fri 13:41] =>  3:51
   CLOCK: [2019-04-18 Thu 16:07]--[2019-04-18 Thu 17:34] =>  1:27
   :END:
*** DONE add SSL: https://gitlab.com/help/user/project/pages/lets_encrypt_for_gitlab_pages.md
    CLOSED: [2019-04-20 Sat 12:03]
*** use Sage interpreter in Hugo
*** DONE add Google analytics
    CLOSED: [2019-02-28 Thu] SCHEDULED: <2019-02-28 Thu>
*** DONE menu sections
    CLOSED: [2019-07-05 Fri 11:20]
*** new theme
    examples:
    - https://themes.gohugo.io//theme/cupper-hugo-theme/post/
    - https://themes.gohugo.io//theme/vanilla-bootstrap-hugo-theme/tags/
    - https://themes.gohugo.io//theme/hugo-bootstrap/
    - https://themes.gohugo.io//theme/minimal/post/
    - https://themes.gohugo.io//theme/hugo-now//
    - https://themes.gohugo.io//theme/minimo/
    requirements:
    - [ ] disqus
    - [ ] google analytics
    - [ ] tags
    - [ ] categories
    - [ ] social links
*** use relative URLs to other posts
